### Reading various file formats

In [6]:
# csv

import pandas as pd

df_csv = pd.read_csv('../data/nyc_taxi_data.csv')

In [7]:
# head and tail

df_csv.head()

,id,vendor_id,pickup_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,store_and_fwd_flag
0,id3004672,1,30-06-16 23:59,1.0,-73.988129,40.732029,-73.990173,40.756680,N
1,id3505355,1,30-06-16 23:59,1.0,-73.964203,40.679993,-73.959808,40.655403,N
2,id1217141,1,30-06-16 23:59,1.0,-73.997437,40.737583,-73.986160,40.729523,N
3,id2150126,2,30-06-16 23:59,1.0,-73.956070,40.771900,-73.986427,40.730469,N
4,id1598245,1,30-06-16 23:59,1.0,-73.970215,40.761475,-73.961510,40.755890,N

In [23]:
df_csv.head(2).T

                                 0               1
id                       id3004672       id3505355
vendor_id                        1               1
pickup_datetime     30-06-16 23:59  30-06-16 23:59
passenger_count                1.0             1.0
pickup_longitude        -73.988129      -73.964203
pickup_latitude          40.732029       40.679993
dropoff_longitude       -73.990173      -73.959808
dropoff_latitude          40.75668       40.655403
store_and_fwd_flag               N               N

In [8]:
df_csv.tail()

,id,vendor_id,pickup_datetime,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude,store_and_fwd_flag
9995,id1897153,2,27-06-16 21:31,1.0,-73.952515,40.771515,-73.980957,40.747963,N
9996,id0752437,2,27-06-16 21:31,1.0,-73.966423,40.772259,-73.954704,40.778240,N
9997,id1002502,1,27-06-16 21:30,1.0,-73.986206,40.722450,-73.965805,40.693207,N
9998,id1522362,1,27-06-16 21:30,1.0,-73.948975,40.782070,-73.951927,40.777500,N
9999,id1084765,2,27-06-16 21:30,1.0,-73.978081,40.773090,-73.989952,40.775028,N

In [9]:
df_csv.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   id                  10000 non-null  object
 1   vendor_id           10000 non-null  int64
 2   pickup_datetime     10000 non-null  object
 3   passenger_count     9997 non-null   float64
 4   pickup_longitude    10000 non-null  float64
 5   pickup_latitude     10000 non-null  float64
 6   dropoff_longitude   10000 non-null  float64
 7   dropoff_latitude    10000 non-null  float64
 8   store_and_fwd_flag  10000 non-null  object
dtypes: float64(5), int64(1), object(3)
memory usage: 703.2+ KB

In [10]:
df_csv.describe()

,vendor_id,passenger_count,pickup_longitude,pickup_latitude,dropoff_longitude,dropoff_latitude
count,10000.000000,9997.000000,10000.000000,10000.000000,10000.000000,10000.000000
mean,1.528300,1.637691,-73.973376,40.751079,-73.972528,40.751738
std,0.499223,1.307232,0.038844,0.027535,0.038789,0.032559
min,1.000000,1.000000,-74.177910,40.604469,-74.326431,40.526310
25%,1.000000,1.000000,-73.991592,40.738761,-73.990976,40.737741
50%,2.000000,1.000000,-73.981316,40.754749,-73.979313,40.755152
75%,2.000000,2.000000,-73.968275,40.767508,-73.963442,40.769332
max,2.000000,6.000000,-73.483597,41.106483,-73.483597,41.106487

In [15]:
# reading text file

df_text = pd.read_csv('../data/OnlineRetail.txt', sep='\t', encoding = 'unicode_escape')

In [16]:
df_text.head()

,InvoiceNo,StockCode,Description,Quantity,InvoiceDate,UnitPrice,CustomerID,Country
0,536365,85123A,WHITE HANGING HEART T-LIGHT HOLDER,6,2010-12-01 8:26,2.55,17850.0,United Kingdom
1,536365,71053,WHITE METAL LANTERN,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
2,536365,84406B,CREAM CUPID HEARTS COAT HANGER,8,2010-12-01 8:26,2.75,17850.0,United Kingdom
3,536365,84029G,KNITTED UNION FLAG HOT WATER BOTTLE,6,2010-12-01 8:26,3.39,17850.0,United Kingdom
4,536365,84029E,RED WOOLLY HOTTIE WHITE HEART.,6,2010-12-01 8:26,3.39,17850.0,United Kingdom

In [18]:
df_text_table = pd.read_table('../data/OnlineRetail.txt', encoding = 'unicode_escape')

In [47]:
# reading a sqlite database
import sqlite3

con = sqlite3.connect('../data/flights.db')
cur = con.cursor()
df = pd.read_sql_query('SELECT * FROM airlines LIMIT 5', con)

In [22]:
df.head()

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

In [48]:
# reading a json file

df_json = pd.read_json('../data/movie.json')

In [49]:
df_json.head()

,David Smith,Brenda Peterson,Bill Duffy,Samuel Miller,Julie Hammel,Clarissa Jackson,Adam Cohen,Chris Duncan
Vertigo,4.0,3.0,4.5,NaN,NaN,5.0,3.5,NaN
Scarface,4.5,1.5,5.0,3.5,2.5,4.5,3.0,NaN
Raging Bull,3.0,1.0,NaN,5.0,NaN,4.0,NaN,4.5
Goodfellas,4.5,2.0,4.5,5.0,3.0,2.5,4.5,NaN
The Apartment,1.0,5.0,1.0,1.0,NaN,1.0,1.0,1.5

In [27]:
l1 = [1, 2, 3]

l2 = [11, 22, 33]

l3 = [111, 222, 333, 444]

In [28]:
# pandas Series- 1D

s1 = pd.Series(l1)
s2= pd.Series(l2)
s3 = pd.Series(l3)

In [29]:
s1 + s2 + s3

0    123.0
1    246.0
2    369.0
3      NaN
dtype: float64

#### Indexing the rows and columns

##### extract columns

In [32]:
df_csv.columns

Index(['id', 'vendor_id', 'pickup_datetime', 'passenger_count',
       'pickup_longitude', 'pickup_latitude', 'dropoff_longitude',
       'dropoff_latitude', 'store_and_fwd_flag'],
      dtype='object')

In [35]:
df_csv.columns[2]

'pickup_datetime'

In [40]:
df_csv['passenger_count'].mean(), df_csv['passenger_count'].min(), df_csv['passenger_count'].max(),

(1.6376913073922177, 1.0, 6.0)

In [45]:
# check for null values
df_csv.isnull().sum()

id                    0
vendor_id             0
pickup_datetime       0
passenger_count       3
pickup_longitude      0
pickup_latitude       0
dropoff_longitude     0
dropoff_latitude      0
store_and_fwd_flag    0
dtype: int64

In [46]:
#loc and iloc

df_csv.loc[0]

id                         id3004672
vendor_id                          1
pickup_datetime       30-06-16 23:59
passenger_count                  1.0
pickup_longitude          -73.988129
pickup_latitude            40.732029
dropoff_longitude         -73.990173
dropoff_latitude            40.75668
store_and_fwd_flag                 N
Name: 0, dtype: object

In [50]:
df_json.loc['Vertigo']

David Smith         4.0
Brenda Peterson     3.0
Bill Duffy          4.5
Samuel Miller       NaN
Julie Hammel        NaN
Clarissa Jackson    5.0
Adam Cohen          3.5
Chris Duncan        NaN
Name: Vertigo, dtype: float64

In [51]:
df_csv.iloc[0]

id                         id3004672
vendor_id                          1
pickup_datetime       30-06-16 23:59
passenger_count                  1.0
pickup_longitude          -73.988129
pickup_latitude            40.732029
dropoff_longitude         -73.990173
dropoff_latitude            40.75668
store_and_fwd_flag                 N
Name: 0, dtype: object

In [53]:

df_sample = pd.DataFrame(['a', 'b', 'c', 'd'], index=[10, 4, 5, 6])

df_sample

    0
10  a
4   b
5   c
6   d

In [ ]:
print(df_sample.loc[4])

print(df_sample.iloc[4])

In [44]:
# casting of the datatypes

df_csv['passenger_count']

0       1.0
1       1.0
2       1.0
3       1.0
4       1.0
       ...
9995    1.0
9996    1.0
9997    1.0
9998    1.0
9999    1.0
Name: passenger_count, Length: 10000, dtype: float64